memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
static void USBCtrlEPService(void);
static void USBCtrlTrfSetupHandler(void);
static void USBCtrlTrfInHandler(void);
static void USBCheckStdRequest(void);
static void USBStdGetDscHandler(void);
static void USBCtrlEPServiceComplete(void);
static void USBCtrlTrfTxService(void);
static void USBCtrlTrfRxService(void);
static void USBStdSetCfgHandler(void);
static void USBStdGetStatusHandler(void);
static void USBStdFeatureReqHandler(void);
static void USBCtrlTrfOutHandler(void);
static void USBConfigureEndpoint(uint8_t EPNum, uint8_t direction);
static void USBWakeFromSuspend(void);
static void USBSuspend(void);
static void USBStallHandler(void);

// *****************************************************************************
// *****************************************************************************
// Section: Macros or Functions
// *****************************************************************************
// *****************************************************************************

/**************************************************************************
    Function:
        void USBDeviceInit(void)

    Description:
        This function initializes the device stack it in the default state. The
        USB module will be completely reset including all of the internal
        variables, registers, and interrupt flags.

    Precondition:
        This function must be called before any of the other USB Device
        functions can be called, including USBDeviceTasks().

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ***************************************************************************/
void USBDeviceInit(void)
{
    uint8_t i;

    USBDisableInterrupts();

    //Make sure that if a GPIO output driver exists on VBUS, that it is
    //tri-stated to avoid potential contention with the host
    USB_HAL_VBUSTristate();

    // Clear all USB error flags
    USBClearInterruptRegister(U1EIR);

    // Clears all USB interrupts
    USBClearInterruptRegister(U1IR);

    //Clear all of the endpoint control registers
    U1EP0 = 0;

    DisableNonZeroEndpoints(USB_MAX_EP_NUMBER);

    SetConfigurationOptions();

    //power up the module (if not already powered)
    USBPowerModule();

    //set the address of the BDT (if applicable)
    USBSetBDTAddress(BDT);

    //Clear all of the BDT entries
    for(i = 0; i < (sizeof(BDT)/sizeof(BDT_ENTRY)); i++) BDT[i].Val = 0x00;

    // Assert reset request to all of the Ping Pong buffer pointers
    USBPingPongBufferReset = 1;

    // Reset to default address
    U1ADDR = 0x00;

    // Make sure packet processing is enabled
    USBPacketDisable = 0;

    //Stop trying to reset ping pong buffer pointers
    USBPingPongBufferReset = 0;

    // Flush any pending transactions
    do {
        USBClearInterruptFlag(USBTransactionCompleteIFReg,USBTransactionCompleteIFBitNum);
        //Initialize USB stack software state variables
        inPipes[0].info.Val = 0;
        outPipes[0].info.Val = 0;
        outPipes[0].wCount.Val = 0;
    } while(USBTransactionCompleteIF == 1);

    //Set flags to true, so the USBCtrlEPAllowStatusStage() function knows not to
    //try and arm a status stage, even before the first control transfer starts.
    USBStatusStageEnabledFlag1 = true;
    USBStatusStageEnabledFlag2 = true;
    //Initialize other flags
    USBDeferINDataStagePackets = false;
    USBDeferOUTDataStagePackets = false;
    USBBusIsSuspended = false;

    //Initialize all pBDTEntryIn[] and pBDTEntryOut[]
    //pointers to NULL, so they don't get used inadvertently.
    for(i = 0; i < (uint8_t)(USB_MAX_EP_NUMBER+1u); i++){
        pBDTEntryIn[i] = 0u;
        pBDTEntryOut[i] = 0u;
        ep_data_in[i].Val = 0u;
        ep_data_out[i].Val = 0u;
    }

    //Get ready for the first packet
    pBDTEntryIn[0] = (volatile BDT_ENTRY*)&BDT[EP0_IN_EVEN];
    // Initialize EP0 as a Ctrl EP
    U1EP0 = EP_CTRL|USB_HANDSHAKE_ENABLED;
    //Prepare for the first SETUP on EP0 OUT
    BDT[EP0_OUT_EVEN].ADR = ConvertToPhysicalAddress(&SetupPkt);
    BDT[EP0_OUT_EVEN].CNT = USB_EP0_BUFF_SIZE;
    BDT[EP0_OUT_EVEN].STAT.Val = _DAT0|_BSTALL;
    BDT[EP0_OUT_EVEN].STAT.Val |= _USIE;

    // Clear active configuration
    USBActiveConfiguration = 0;

    USB1msTickCount = 0;            //Keeps track of total number of milliseconds since calling USBDeviceInit() when first initializing the USB module/stack code.
    USBTicksSinceSuspendEnd = 0;    //Keeps track of the number of milliseconds since a suspend condition has ended.

    //Indicate that we are now in the detached state
    USBDeviceState = DETACHED_STATE;
}



/**************************************************************************
  Function:
        void USBDeviceTasks(void)

  Summary:
    This function is the main state machine/transaction handler of the USB
    device side stack.  When the USB stack is operated in "USB_POLLING" mode
    (usb_device_config.h user option) the USBDeviceTasks() function should be called
    periodically to receive and transmit packets through the stack. This
    function also takes care of control transfers associated with the USB
    enumeration process, and detecting various USB events (such as suspend).
    This function should be called at least once every 1.8ms during the USB
    enumeration process. After the enumeration process is complete (which can
    be determined when USBGetDeviceState() returns CONFIGURED_STATE), the
    USBDeviceTasks() handler may be called the faster of: either once
    every 9.8ms, or as often as needed to make sure that the hardware USTAT
    FIFO never gets full.  A good rule of thumb is to call USBDeviceTasks() at
    a minimum rate of either the frequency that USBTransferOnePacket() gets
    called, or, once/1.8ms, whichever is faster.  See the inline code comments
    near the top of usb_device.c for more details about minimum timing
    requirements when calling USBDeviceTasks().

    When the USB stack is operated in "USB_INTERRUPT" mode, it is not necessary
    to call USBDeviceTasks() from the main loop context.  In the USB_INTERRUPT
    mode, the USBDeviceTasks() handler only needs to execute when a USB
    interrupt occurs, and therefore only needs to be called from the interrupt
    context.

  Description:
    This function is the main state machine/transaction handler of the USB
    device side stack.  When the USB stack is operated in "USB_POLLING" mode
    (usb_device_config.h user option) the USBDeviceTasks() function should be called
    periodically to receive and transmit packets through the stack. This
    function also takes care of control transfers associated with the USB
    enumeration process, and detecting various USB events (such as suspend).
    This function should be called at least once every 1.8ms during the USB
    enumeration process. After the enumeration process is complete (which can
    be determined when USBGetDeviceState() returns CONFIGURED_STATE), the
    USBDeviceTasks() handler may be called the faster of: either once
    every 9.8ms, or as often as needed to make sure that the hardware USTAT
    FIFO never gets full.  A good rule of thumb is to call USBDeviceTasks() at
    a minimum rate of either the frequency that USBTransferOnePacket() gets
    called, or, once/1.8ms, whichever is faster.  See the inline code comments
    near the top of usb_device.c for more details about minimum timing
    requirements when calling USBDeviceTasks().

    When the USB stack is operated in "USB_INTERRUPT" mode, it is not necessary
    to call USBDeviceTasks() from the main loop context.  In the USB_INTERRUPT
    mode, the USBDeviceTasks() handler only needs to execute when a USB
    interrupt occurs, and therefore only needs to be called from the interrupt
    context.

    Typical usage:
    <code>
    void main(void)
    {
        USBDeviceInit();
        while(1)
        {
            USBDeviceTasks(); //Takes care of enumeration and other USB events
            if((USBGetDeviceState() \< CONFIGURED_STATE) ||
               (USBIsDeviceSuspended() == true))
            {
                //Either the device is not configured or we are suspended,
                // so we don't want to execute any USB related application code
                continue;   //go back to the top of the while loop
            }
            else
            {
                //Otherwise we are free to run USB and non-USB related user
                //application code.
                UserApplication();
            }
        }
    }
    </code>

  Precondition:
    Make sure the USBDeviceInit() function has been called prior to calling
    USBDeviceTasks() for the first time.
  Remarks:
    USBDeviceTasks() does not need to be called while in the USB suspend mode,
    if the user application firmware in the USBCBSuspend() callback function
    enables the ACTVIF USB interrupt source and put the microcontroller into
    sleep mode.  If the application firmware decides not to sleep the
    microcontroller core during USB suspend (ex: continues running at full
    frequency, or clock switches to a lower frequency), then the USBDeviceTasks()
    function must still be called periodically, at a rate frequent enough to
    ensure the 10ms resume recovery interval USB specification is met.  Assuming
    a worst case primary oscillator and PLL start up time of less than 5ms, then
    USBDeviceTasks() should be called once every 5ms in this scenario.

    When the USB cable is detached, or the USB host is not actively powering
    the VBUS line to +5V nominal, the application firmware does not always have
    to call USBDeviceTasks() frequently, as no USB activity will be taking
    place.  However, if USBDeviceTasks() is not called regularly, some
    alternative means of promptly detecting when VBUS is powered (indicating
    host attachment), or not powered (host powered down or USB cable unplugged)
    is still needed.  For self or dual self/bus powered USB applications, see
    the USBDeviceAttach() and USBDeviceDetach() API documentation for additional
    considerations.
    ***************************************************************************/
void USBDeviceTasks(void)
{
    uint8_t i;

    if(USBDeviceState == ATTACHED_STATE){
        /*
         * After enabling the USB module, it takes some time for the
         * voltage on the D+ or D- line to rise high enough to get out
         * of the SE0 condition. The USB Reset interrupt should not be
         * unmasked until the SE0 condition is cleared. This helps
         * prevent the firmware from misinterpreting this unique event
         * as a USB bus reset from the USB host.
         */

