memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
        if(!USBSE0Event){
            //We recently attached, make sure we are in a clean state
            U1IR = 0xFFEF;  //Preserve IDLEIF info, so we can detect suspend
                                //during attach de-bounce interval

            USBResetIE = 1;             // Unmask RESET interrupt
            USBIdleIE = 1;             // Unmask IDLE interrupt
            USBDeviceState = POWERED_STATE;
        }
    }

    /*
     * Task A: Service USB Activity Interrupt
     */
    if(USBActivityIF && USBActivityIE){
        USBClearInterruptFlag(USBActivityIFReg,USBActivityIFBitNum);
        USBWakeFromSuspend();
    }

    /*
     * Pointless to continue servicing if the device is in suspend mode.
     */
    if(USBSuspendControl){
        USBClearUSBInterrupt();
        return;
    }

    /*
     * Task B: Service USB Bus Reset Interrupt.
     * When bus reset is received during suspend, ACTVIF will be set first,
     * once the UCONbits.SUSPND is clear, then the URSTIF bit will be asserted.
     * This is why URSTIF is checked after ACTVIF.
     *
     * The USB reset flag is masked when the USB state is in
     * DETACHED_STATE or ATTACHED_STATE, and therefore cannot
     * cause a USB reset event during these two states.
     */
    if(USBResetIF && USBResetIE){
        USBDeviceInit();

        //Re-enable the interrupts since the USBDeviceInit() function will
        //  disable them.  This will do nothing in a polling setup
        USBUnmaskInterrupts();
        USBDeviceState = DEFAULT_STATE;
        USBClearInterruptFlag(USBResetIFReg,USBResetIFBitNum);
    }

    /*
     * Task C: Service other USB interrupts
     */
    if(USBIdleIF && USBIdleIE) USBSuspend();

    //Check if a 1ms interval has elapsed.
    if(USBT1MSECIF){
        USBClearInterruptFlag(USBT1MSECIFReg, USBT1MSECIFBitNum);
        USBIncrement1msInternalTimers();
    }

    //Start-of-Frame Interrupt
    if(USBSOFIF){
        //Call the user SOF event callback if enabled.
        if(USBSOFIE) USB_SOF_HANDLER(EVENT_SOF,0,1);
        USBClearInterruptFlag(USBSOFIFReg,USBSOFIFBitNum);

        #if defined(USB_ENABLE_STATUS_STAGE_TIMEOUTS)
            //Supporting this feature requires a 1ms time base for keeping track of the timeout interval.
            //Decrement our status stage counter.
            if(USBStatusStageTimeoutCounter) USBStatusStageTimeoutCounter--;
            //Check if too much time has elapsed since progress was made in
            //processing the control transfer, without arming the status stage.
            //If so, auto-arm the status stage to ensure that the control
            //transfer can [eventually] complete, within the timing limits
            //dictated by section 9.2.6 of the official USB 2.0 specifications.
            if(USBStatusStageTimeoutCounter == 0){
                USBCtrlEPAllowStatusStage();    //Does nothing if the status stage was already armed.
            }
        #endif
    }

    if(USBStallIF && USBStallIE) USBStallHandler();

    if(USBErrorIF && USBErrorIE){
        USB_ERROR_HANDLER(EVENT_BUS_ERROR,0,1);
        USBClearInterruptRegister(U1EIR);               // This clears UERRIF
        USBClearInterruptFlag( USBErrorIFReg, USBErrorIFBitNum );
    }

    /*
     * Pointless to continue servicing if the host has not sent a bus reset.
     * Once bus reset is received, the device transitions into the DEFAULT
     * state and is ready for communication.
     */
    if(USBDeviceState < DEFAULT_STATE){
        USBClearUSBInterrupt();
        return;
    }

    /*
     * Task D: Servicing USB Transaction Complete Interrupt
     */
    if(USBTransactionCompleteIE){
        for(i = 0; i < 4u; i++){    //Drain or deplete the USAT FIFO entries.  If the USB FIFO ever gets full, USB bandwidth
            //utilization can be compromised, and the device won't be able to receive SETUP packets.
            if(!USBTransactionCompleteIF) break;
                //Save and extract USTAT register info.  Will use this info later.
                USTATcopy.Val = U1STAT;
                endpoint_number = USBHALGetLastEndpoint(USTATcopy);

                USBClearInterruptFlag(USBTransactionCompleteIFReg,USBTransactionCompleteIFBitNum);

                //Keep track of the hardware ping pong state for endpoints other
                //than EP0, if ping pong buffering is enabled.
                if(USBHALGetLastDirection(USTATcopy) == OUT_FROM_HOST){
                    ep_data_out[endpoint_number].bits.ping_pong_state ^= 1;
                } else {
                    ep_data_in[endpoint_number].bits.ping_pong_state ^= 1;
                }

                //USBCtrlEPService only services transactions over EP0.
                //It ignores all other EP transactions.
                if(endpoint_number == 0){
                    USBCtrlEPService();
                } else {
                    USB_TRANSFER_COMPLETE_HANDLER(EVENT_TRANSFER, (uint8_t*)&USTATcopy.Val, 0);
                }
        }
    }//end if(USBTransactionCompleteIE)

    USBClearUSBInterrupt();
}//end of USBDeviceTasks()

/*******************************************************************************
  Function:
        void USBEnableEndpoint(uint8_t ep, uint8_t options)

  Summary:
    This function will enable the specified endpoint with the specified
    options
  Description:
    This function will enable the specified endpoint with the specified
    options.

    Typical Usage:
    <code>
    void USBCBInitEP(void)
    {
        USBEnableEndpoint(MSD_DATA_IN_EP,USB_IN_ENABLED|USB_OUT_ENABLED|USB_HANDSHAKE_ENABLED|USB_DISALLOW_SETUP);
        USBMSDInit();
    }
    </code>

    In the above example endpoint number MSD_DATA_IN_EP is being configured
    for both IN and OUT traffic with handshaking enabled. Also since
    MSD_DATA_IN_EP is not endpoint 0 (MSD does not allow this), then we can
    explicitly disable SETUP packets on this endpoint.
  Conditions:
    None
  Input:
    uint8_t ep -       the endpoint to be configured
    uint8_t options -  optional settings for the endpoint. The options should
                    be ORed together to form a single options string. The
                    available optional settings for the endpoint. The
                    options should be ORed together to form a single options
                    string. The available options are the following\:
                    * USB_HANDSHAKE_ENABLED enables USB handshaking (ACK,
                      NAK)
                    * USB_HANDSHAKE_DISABLED disables USB handshaking (ACK,
                      NAK)
                    * USB_OUT_ENABLED enables the out direction
                    * USB_OUT_DISABLED disables the out direction
                    * USB_IN_ENABLED enables the in direction
                    * USB_IN_DISABLED disables the in direction
                    * USB_ALLOW_SETUP enables control transfers
                    * USB_DISALLOW_SETUP disables control transfers
                    * USB_STALL_ENDPOINT STALLs this endpoint
  Return:
    None
  Remarks:
    None
  *****************************************************************************/
void USBEnableEndpoint(uint8_t ep, uint8_t options)
{
    unsigned char* p;

    //Use USBConfigureEndpoint() to set up the pBDTEntryIn/Out[ep] pointer and
    //starting DTS state in the BDT entry.
    if(options & USB_OUT_ENABLED) USBConfigureEndpoint(ep, OUT_FROM_HOST);
    if(options & USB_IN_ENABLED) USBConfigureEndpoint(ep, IN_TO_HOST);

