memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
    Remarks:
        None

 *******************************************************************/
void USBStallEndpoint(uint8_t ep, uint8_t dir)
{
    BDT_ENTRY *p;

    if(ep == 0){
        //For control endpoints (ex: EP0), we need to STALL both IN and OUT
        //endpoints.  EP0 OUT must also be prepared to receive the next SETUP
        //packet that will arrive.
        pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&SetupPkt);
        pBDTEntryEP0OutNext->STAT.Val = _DAT0|(_DTSEN & _DTS_CHECKING_ENABLED)|_BSTALL;
        pBDTEntryEP0OutNext->STAT.Val |= _USIE;
        pBDTEntryIn[0]->STAT.Val = _BSTALL;
        pBDTEntryIn[0]->STAT.Val |= _USIE;

    } else {
        p = (BDT_ENTRY*)(&BDT[EP(ep,dir,0)]);
        p->STAT.Val |= _BSTALL;
        p->STAT.Val |= _USIE;

        //If the device is in FULL or ALL_BUT_EP0 ping pong modes
        //then stall that entry as well
        p = (BDT_ENTRY*)(&BDT[EP(ep,dir,1)]);
        p->STAT.Val |= _BSTALL;
        p->STAT.Val |= _USIE;
    }
}

/**************************************************************************
    Function:
        void USBCancelIO(uint8_t endpoint)

    Description:
        This function cancels the transfers pending on the specified endpoint.
        This function can only be used after a SETUP packet is received and
        before that setup packet is handled.  This is the time period in which
        the EVENT_EP0_REQUEST is thrown, before the event handler function
        returns to the stack.

    Precondition:

    Parameters:
        uint8_t endpoint - the endpoint number you wish to cancel the transfers for

    Return Values:
        None

    Remarks:
        None

  **************************************************************************/
void USBCancelIO(uint8_t endpoint)
{
    if(USBPacketDisable != 1) return;
    //The PKTDIS bit is currently set right now.  It is therefore "safe"
    //to mess with the BDT right now.
    pBDTEntryIn[endpoint]->Val &= _DTSMASK;    //Makes UOWN = 0 (_UCPU mode).  Deactivates endpoint.  Only sends NAKs.
    pBDTEntryIn[endpoint]->Val ^= _DTSMASK;    //Toggle the DTS bit.  This packet didn't get sent yet, and the next call to USBTransferOnePacket() will re-toggle the DTS bit back to the original (correct) value.

    //Need to do additional handling if ping-pong buffering is being used
    //Point to the next buffer for ping pong purposes.  UOWN getting cleared
    //(either due to SIE clearing it after a transaction, or the firmware
    //clearing it) makes hardware ping pong pointer advance.
    pBDTEntryIn[endpoint] = (BDT_ENTRY*)(((uintptr_t)pBDTEntryIn[endpoint]) ^ USB_NEXT_PING_PONG);

    pBDTEntryIn[endpoint]->STAT.Val &= _DTSMASK;
    pBDTEntryIn[endpoint]->STAT.Val ^= _DTSMASK;
}

/**************************************************************************
    Function:
        void USBDeviceDetach(void)

    Summary:
        This function configures the USB module to "soft detach" itself from
        the USB host.

    Description:
        This function configures the USB module to perform a "soft detach"
        operation, by disabling the D+ (or D-) ~1.5k pull up resistor, which
        lets the host know the device is present and attached.  This will make
        the host think that the device has been unplugged.  This is potentially
        useful, as it allows the USB device to force the host to re-enumerate
        the device (on the firmware has re-enabled the USB module/pull up, by
        calling USBDeviceAttach(), to "soft re-attach" to the host).

    Precondition:
        Should only be called when USB_INTERRUPT is defined.  See remarks
        section if USB_POLLING mode option is being used (usb_device_config.h option).

        Additionally, this function should only be called from the main() loop
        context.  Do not call this function from within an interrupt handler, as
        this function may modify global interrupt enable bits and settings.

    Parameters:
        None

    Return Values:
        None

    Remarks:
        If the application firmware calls USBDeviceDetach(), it is strongly
        recommended that the firmware wait at least >= 80ms before calling
        USBDeviceAttach().  If the firmware performs a soft detach, and then
        re-attaches too soon (ex: after a few micro seconds for instance), some
        hosts may interpret this as an unexpected "glitch" rather than as a
        physical removal/re-attachment of the USB device.  In this case the host
        may simply ignore the event without re-enumerating the device.  To
        ensure that the host properly detects and processes the device soft
        detach/re-attach, it is recommended to make sure the device remains
        detached long enough to mimic a real human controlled USB
        unplug/re-attach event (ex: after calling USBDeviceDetach(), do not
        call USBDeviceAttach() for at least 80+ms, preferably longer.

        Neither the USBDeviceDetach() or USBDeviceAttach() functions are blocking
        or take long to execute.  It is the application firmwares
        responsibility for adding the 80+ms delay, when using these API
        functions.

        Note: The Windows plug and play event handler processing is fairly
        slow, especially in certain versions of Windows, and for certain USB
        device classes.  It has been observed that some device classes need to
        provide even more USB detach dwell interval (before calling
        USBDeviceAttach()), in order to work correctly after re-enumeration.
        If the USB device is a CDC class device, it is recommended to wait
        at least 1.5 seconds or longer, before soft re-attaching to the host,
        to provide the plug and play event handler enough time to finish
        processing the removal event, before the re-attach occurs.

        If the application is using the USB_POLLING mode option, then the
        USBDeviceDetach() and USBDeviceAttach() functions are not available.
        In this mode, the USB stack relies on the "#define USE_USB_BUS_SENSE_IO"
        and "#define USB_BUS_SENSE" options in the
        HardwareProfile ? [platform name].h file.

        When using the USB_POLLING mode option, and the
        "#define USE_USB_BUS_SENSE_IO" definition has been commented out, then
        the USB stack assumes that it should always enable the USB module at
        pretty much all times.  Basically, anytime the application firmware
        calls USBDeviceTasks(), the firmware will automatically enable the USB
        module.  This mode would typically be selected if the application was
        designed to be a purely bus powered device.  In this case, the
        application is powered from the +5V VBUS supply from the USB port, so
        it is correct and sensible in this type of application to power up and
        turn on the USB module, at anytime that the microcontroller is
        powered (which implies the USB cable is attached and the host is also
        powered).

        In a self powered application, the USB stack is designed with the
        intention that the user will enable the "#define USE_USB_BUS_SENSE_IO"
        option in the HardwareProfile ? [platform name].h file.  When this
        option is defined, then the USBDeviceTasks() function will automatically
        check the I/O pin port value of the designated pin (based on the
        #define USB_BUS_SENSE option in the HardwareProfile ? [platform name].h
        file), every time the application calls USBDeviceTasks().  If the
        USBDeviceTasks() function is executed and finds that the pin defined by
        the #define USB_BUS_SENSE is in a logic low state, then it will
        automatically disable the USB module and tri-state the D+ and D- pins.
        If however the USBDeviceTasks() function is executed and finds the pin
        defined by the #define USB_BUS_SENSE is in a logic high state, then it
        will automatically enable the USB module, if it has not already been
        enabled.

  **************************************************************************/
void USBDeviceDetach(void)
{
    //If the interrupt option is selected then the customer is required
    //  to notify the stack when the device is attached or removed from the
    //  bus by calling the USBDeviceAttach() and USBDeviceDetach() functions.
    // Disable module & detach from bus
    U1CON = 0;

    // Mask all USB interrupts
    U1IE = 0;

    //Move to the detached state
    USBDeviceState = DETACHED_STATE;
}
/**************************************************************************
    Function:
        void USBDeviceAttach(void)

    Summary:
        Checks if VBUS is present, and that the USB module is not already
        initialized, and if so, enables the USB module so as to signal device
        attachment to the USB host.

    Description:
        This function indicates to the USB host that the USB device has been
        attached to the bus.  This function needs to be called in order for the
        device to start to enumerate on the bus.

    Precondition:
        Should only be called when USB_INTERRUPT is defined.  Also, should only
        be called from the main() loop context.  Do not call USBDeviceAttach()
        from within an interrupt handler, as the USBDeviceAttach() function
        may modify global interrupt enable bits and settings.

        For normal USB devices:
        Make sure that if the module was previously on, that it has been turned off
        for a long time (ex: 100ms+) before calling this function to re-enable the module.
        If the device turns off the D+ (for full speed) or D- (for low speed) ~1.5k ohm
        pull up resistor, and then turns it back on very quickly, common hosts will sometimes
        reject this event, since no human could ever unplug and re-attach a USB device in a
        microseconds (or nanoseconds) timescale.  The host could simply treat this as some kind
        of glitch and ignore the event altogether.
    Parameters:
        None

    Return Values:
        None

