memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
    Remarks:
        See also the USBDeviceDetach() API function documentation.
****************************************************************************/
void USBDeviceAttach(void)
{
    if(USBDeviceState != DETACHED_STATE || USB_BUS_SENSE != 1) return;
    //if we are in the detached state and bus sense set
    //Initialize registers to known states.
    U1CON = 0;

    // Mask all USB interrupts
    U1IE = 0;

    //Configure things like: pull ups, full/low-speed mode,
    //set the ping pong mode, and set internal transceiver
    SetConfigurationOptions();

    USBEnableInterrupts();  //Modifies global interrupt settings

    // Enable module & attach to bus
    while(!U1CONbits.USBEN){U1CONbits.USBEN = 1;}

    //moved to the attached state
    USBDeviceState = ATTACHED_STATE;
}


/*******************************************************************************
  Function: void USBCtrlEPAllowStatusStage(void);

  Summary: This function prepares the proper endpoint 0 IN or endpoint 0 OUT
            (based on the controlTransferState) to allow the status stage packet
            of a control transfer to complete.  This function gets used
            internally by the USB stack itself, but it may also be called from
            the application firmware, IF the application firmware called
            the USBDeferStatusStage() function during the initial processing
            of the control transfer request.  In this case, the application
            must call the USBCtrlEPAllowStatusStage() once, after it has fully
            completed processing and handling the data stage portion of the
            request.

            If the application firmware has no need for delaying control
            transfers, and therefore never calls USBDeferStatusStage(), then the
            application firmware should not call USBCtrlEPAllowStatusStage().

  Description:

  Conditions:
    None

  Input:

  Return:

  Remarks:
    None
  *****************************************************************************/
void USBCtrlEPAllowStatusStage(void)
{
    //Check and set two flags, prior to actually modifying any BDT entries.
    //This double checking is necessary to make certain that
    //USBCtrlEPAllowStatusStage() can be called twice simultaneously (ex: once
    //in main loop context, while simultaneously getting an interrupt which
    //tries to call USBCtrlEPAllowStatusStage() again, at the same time).
    if(USBStatusStageEnabledFlag1 == false){
        USBStatusStageEnabledFlag1 = true;
        if(USBStatusStageEnabledFlag2 == false){
            USBStatusStageEnabledFlag2 = true;

            //Determine which endpoints (EP0 IN or OUT needs arming for the status
            //stage), based on the type of control transfer currently pending.
            if(controlTransferState == CTRL_TRF_RX){
                pBDTEntryIn[0]->CNT = 0;
                pBDTEntryIn[0]->STAT.Val = _DAT1|(_DTSEN & _DTS_CHECKING_ENABLED);
                pBDTEntryIn[0]->STAT.Val |= _USIE;
            } else if(controlTransferState == CTRL_TRF_TX){
                BothEP0OutUOWNsSet = false;    //Indicator flag used in USBCtrlTrfOutHandler()

                //This buffer (when ping pong buffering is enabled on EP0 OUT) receives the
                //next SETUP packet.
                pBDTEntryEP0OutCurrent->CNT = USB_EP0_BUFF_SIZE;
                pBDTEntryEP0OutCurrent->ADR = ConvertToPhysicalAddress(&SetupPkt);
                pBDTEntryEP0OutCurrent->STAT.Val = _BSTALL; //Prepare endpoint to accept a SETUP transaction
                pBDTEntryEP0OutCurrent->STAT.Val |= _USIE;
                BothEP0OutUOWNsSet = true;    //Indicator flag used in USBCtrlTrfOutHandler()

                //This EP0 OUT buffer receives the 0-byte OUT status stage packet.
                pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
                pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&SetupPkt);
                pBDTEntryEP0OutNext->STAT.Val = _USIE;           // Note: DTSEN is 0
            }
        }
    }
}


/*******************************************************************************
  Function: void USBCtrlEPAllowDataStage(void);

  Summary: This function allows the data stage of either a host-to-device or
            device-to-host control transfer (with data stage) to complete.
            This function is meant to be used in conjunction with either the
            USBDeferOUTDataStage() or USBDeferINDataStage().  If the firmware
            does not call either USBDeferOUTDataStage() or USBDeferINDataStage(),
            then the firmware does not need to manually call
            USBCtrlEPAllowDataStage(), as the USB stack will call this function
            instead.

  Description:

  Conditions: A control transfer (with data stage) should already be pending,
                if the firmware calls this function.  Additionally, the firmware
                should have called either USBDeferOUTDataStage() or
                USBDeferINDataStage() at the start of the control transfer, if
                the firmware will be calling this function manually.

  Input:

  Return:

  Remarks:
  *****************************************************************************/
void USBCtrlEPAllowDataStage(void)
{
    USBDeferINDataStagePackets = false;
    USBDeferOUTDataStagePackets = false;

    if(controlTransferState == CTRL_TRF_RX){ //(<setup><out><out>...<out><in>)
        //Prepare EP0 OUT to receive the first OUT data packet in the data stage sequence.
        pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&CtrlTrfData);
        pBDTEntryEP0OutNext->STAT.Val = _DAT1|(_DTSEN & _DTS_CHECKING_ENABLED);
        pBDTEntryEP0OutNext->STAT.Val |= _USIE;
    } else {    //else must be controlTransferState == CTRL_TRF_TX (<setup><in><in>...<in><out>)
        //Error check the data stage byte count.  Make sure the user specified
        //value was no greater than the number of bytes the host requested.
        if(SetupPkt.wLength < inPipes[0].wCount.Val) inPipes[0].wCount.Val = SetupPkt.wLength;
        USBCtrlTrfTxService();  //Copies one IN data packet worth of data from application buffer
                                //to CtrlTrfData buffer.  Also keeps track of how many bytes remaining.

        //Cnt should have been initialized by responsible request owner (ex: by
        //using the USBEP0SendRAMPtr() or USBEP0SendROMPtr() API function).
        pBDTEntryIn[0]->ADR = ConvertToPhysicalAddress(&CtrlTrfData);
        pBDTEntryIn[0]->STAT.Val = _DAT1|(_DTSEN & _DTS_CHECKING_ENABLED);
        pBDTEntryIn[0]->STAT.Val |= _USIE;
    }
}


/******************************************************************************/
/** Internal Functions *********************************************************/
/******************************************************************************/

