memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
/********************************************************************
 * Function:        void USBConfigureEndpoint(uint8_t EPNum, uint8_t direction)
 *
 * PreCondition:    None
 *
 * Input:           uint8_t EPNum - the endpoint to be configured
 *                  uint8_t direction - the direction to be configured
 *                                   (either OUT_FROM_HOST or IN_TO_HOST)
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function will configure the specified
 *                  endpoint
 *
 * Note:            None
 *******************************************************************/
static void USBConfigureEndpoint(uint8_t EPNum, uint8_t direction)
{
    volatile BDT_ENTRY* handle;

    //Compute a pointer to the even BDT entry corresponding to the
    //EPNum and direction values passed to this function.
    handle = (volatile BDT_ENTRY*)&BDT[EP0_OUT_EVEN]; //Get address of start of BDT
    handle += EP(EPNum,direction,0u);     //Add in offset to the BDT of interest

    handle->STAT.UOWN = 0;  //mostly redundant, since USBStdSetCfgHandler()
    //already cleared the entire BDT table

    //Make sure our pBDTEntryIn/Out[] pointer is initialized.  Needed later
    //for USBTransferOnePacket() API calls.
    if(direction == OUT_FROM_HOST) pBDTEntryOut[EPNum] = handle;
    else pBDTEntryIn[EPNum] = handle;

    handle->STAT.DTS = 0;
    (handle+1)->STAT.DTS = 1;
}


/******************************************************************************
 * Function:        void USBCtrlEPServiceComplete(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine wrap up the remaining tasks in servicing
 *                  a Setup Request. Its main task is to set the endpoint
 *                  controls appropriately for a given situation. See code
 *                  below.
 *                  There are three main scenarios:
 *                  a) There was no handler for the Request, in this case
 *                     a STALL should be sent out.
 *                  b) The host has requested a read control transfer,
 *                     endpoints are required to be setup in a specific way.
 *                  c) The host has requested a write control transfer, or
 *                     a control data stage is not required, endpoints are
 *                     required to be setup in a specific way.
 *
 *                  Packet processing is resumed by clearing PKTDIS bit.
 *
 * Note:            None
 *****************************************************************************/
static void USBCtrlEPServiceComplete(void)
{
    /*
     * PKTDIS bit is set when a Setup Transaction is received.
     * Clear to resume packet processing.
     */
    USBPacketDisable = 0;

    //Check the busy bits and the SetupPtk.DataDir variables to determine what type of
    //control transfer is currently in progress.  We need to know the type of control
    //transfer that is currently pending, in order to know how to properly arm the
    //EP0 IN and EP0 OUT endpoints.
    if(inPipes[0].info.bits.busy == 0){
        if(outPipes[0].info.bits.busy == 1){
            controlTransferState = CTRL_TRF_RX;
            /*
             * Control Write:
             * <SETUP[0]><OUT[1]><OUT[0]>...<IN[1]> | <SETUP[0]>
             */

            //1. Prepare OUT EP to receive data, unless a USB class request handler
            //   function decided to defer the data stage (ex: because the intended
            //   RAM buffer wasn't available yet) by calling USBDeferDataStage().
            //   If it did so, it is then responsible for calling USBCtrlEPAllowDataStage(),
            //   once it is ready to begin receiving the data.
            if(USBDeferOUTDataStagePackets == false) USBCtrlEPAllowDataStage();

            //2.  IN endpoint 0 status stage will be armed by USBCtrlEPAllowStatusStage()
            //after all of the OUT data has been received and consumed, or if a timeout occurs.
            USBStatusStageEnabledFlag2 = false;
            USBStatusStageEnabledFlag1 = false;
        } else {
            /*
             * If no one knows how to service this request then stall.
             * Must also prepare EP0 to receive the next SETUP transaction.
             */
            pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
            pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&SetupPkt);
            pBDTEntryEP0OutNext->STAT.Val = _DAT0|(_DTSEN & _DTS_CHECKING_ENABLED)|_BSTALL;
            pBDTEntryEP0OutNext->STAT.Val |= _USIE;
            pBDTEntryIn[0]->STAT.Val = _BSTALL;
            pBDTEntryIn[0]->STAT.Val |= _USIE;
        }
    } else {    // A module has claimed ownership of the control transfer session.
        if(SetupPkt.DataDir == USB_SETUP_DEVICE_TO_HOST_BITFIELD){
            controlTransferState = CTRL_TRF_TX;
            /*
             * Control Read:
             * <SETUP[0]><IN[1]><IN[0]>...<OUT[1]> | <SETUP[0]>
             *
             * 1. Prepare IN EP to transfer data to the host.  If however the data
             *    wasn't ready yet (ex: because the firmware needs to go and read it from
             *    some slow/currently unavailable resource, such as an external I2C EEPconst),
             *    Then the class request handler responsible should call the USBDeferDataStage()
             *    macro.  In this case, the firmware may wait up to 500ms, before it is required
             *    to transmit the first IN data packet.  Once the data is ready, and the firmware
             *    is ready to begin sending the data, it should then call the
             *    USBCtrlEPAllowDataStage() function to start the data stage.
             */
            if(USBDeferINDataStagePackets == false) USBCtrlEPAllowDataStage();

            // 2. (Optionally) allow the status stage now, to prepare for early termination.
            //    Note: If a class request handler decided to set USBDeferStatusStagePacket == true,
            //    then it is responsible for eventually calling USBCtrlEPAllowStatusStage() once it
            //    is ready.  If the class request handler does this, it needs to be careful to
            //    be written so that it can handle the early termination scenario.
            //    Ex: It should call USBCtrlEPAllowStatusStage() when any of the following occurs:
            //    1.  The desired total number of bytes were sent to the host.
            //    2.  The number of bytes that the host originally requested (in the SETUP packet that
            //        started the control transfer) has been reached.
            //    3.  Or, if a timeout occurs (ex: <50ms since the last successful EP0 IN transaction), regardless
            //        of how many bytes have actually been sent.  This is necessary to prevent a deadlock situation
            //        (where the control transfer can't complete, due to continuous NAK on status stage) if the
            //        host performs early termination.  If enabled, the USB_ENABLE_STATUS_STAGE_TIMEOUTS usb_device_config.h
            //        option can take care of this for you.
            //    Note: For this type of control transfer, there is normally no harm in simply arming the
            //    status stage packet right now, even if the IN data is not ready yet.  This allows for
            //    immediate early termination, without adding unnecessary delay.  Therefore, it is generally not
            //    recommended for the USB class handler firmware to call USBDeferStatusStage(), for this
            //    type of control transfer.  If the USB class handler firmware needs more time to fetch the IN
            //    data that needs to be sent to the host, it should instead use the USBDeferDataStage() function.
            USBStatusStageEnabledFlag2 = false;
            USBStatusStageEnabledFlag1 = false;
            if(USBDeferStatusStagePacket == false) USBCtrlEPAllowStatusStage();
        } else {   // (SetupPkt.DataDir == USB_SETUP_DIRECTION_HOST_TO_DEVICE)
            //This situation occurs for special types of control transfers,
            //such as that which occurs when the host sends a SET_ADDRESS
            //control transfer.  Ex:
            //
            //<SETUP[0]><IN[1]> | <SETUP[0]>

            //Although the data direction is HOST_TO_DEVICE, there is no data stage
            //(hence: outPipes[0].info.bits.busy == 0).  There is however still
            //an IN status stage.

            controlTransferState = CTRL_TRF_RX;     //Since this is a HOST_TO_DEVICE control transfer

            //1. Prepare OUT EP to receive the next SETUP packet.
            pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
            pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&SetupPkt);
            pBDTEntryEP0OutNext->STAT.Val = _BSTALL;
            pBDTEntryEP0OutNext->STAT.Val |= _USIE;

            //2. Prepare for IN status stage of the control transfer
            USBStatusStageEnabledFlag2 = false;
            USBStatusStageEnabledFlag1 = false;
            if(USBDeferStatusStagePacket == false) USBCtrlEPAllowStatusStage();
        }

