memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
    }//end if(ctrl_trf_session_owner == MUID_NULL)

}//end USBCtrlEPServiceComplete


/******************************************************************************
 * Function:        void USBCtrlTrfTxService(void)
 *
 * PreCondition:    pSrc, wCount, and usb_stat.ctrl_trf_mem are setup properly.
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine is used for device to host control transfers
 *                    (IN transactions).  This function takes care of managing a
 *                  transfer over multiple USB transactions.
 *                    This routine should be called from only two places.
 *                  One from USBCtrlEPServiceComplete() and one from
 *                  USBCtrlTrfInHandler().
 *
 * Note:
 *****************************************************************************/
static void USBCtrlTrfTxService(void)
{
    uint8_t byteToSend;

    //Figure out how many bytes of data to send in the next IN transaction.
    //Assume a full size packet, unless otherwise determined below.
    byteToSend = USB_EP0_BUFF_SIZE;
    if(inPipes[0].wCount.Val < (uint8_t)USB_EP0_BUFF_SIZE){
        byteToSend = inPipes[0].wCount.Val;

        //Keep track of whether or not we have sent a "short packet" yet.
        //This is useful so that later on, we can configure EP0 IN to STALL,
        //after we have sent all of the intended data.  This makes sure the
        //hardware STALLs if the host erroneously tries to send more IN token
        //packets, requesting more data than intended in the control transfer.
        if(shortPacketStatus == SHORT_PKT_NOT_USED) shortPacketStatus = SHORT_PKT_PENDING;
        else if(shortPacketStatus == SHORT_PKT_PENDING) shortPacketStatus = SHORT_PKT_SENT;
    }

    //Keep track of how many bytes remain to be sent in the transfer, by
    //subtracting the number of bytes about to be sent from the total.
    inPipes[0].wCount.Val -= byteToSend;

    //Next, load the number of bytes to send to BC7..0 in buffer descriptor.
    //Note: Control endpoints may never have a max packet size of > 64 bytes.
    //Therefore, the BC8 and BC9 bits should always be maintained clear.
    pBDTEntryIn[0]->CNT = byteToSend;

    //Now copy the data from the source location, to the CtrlTrfData[] buffer,
    //which we will send to the host.
    pDst = (USB_VOLATILE uint8_t*)CtrlTrfData;                // Set destination pointer
    if(inPipes[0].info.bits.ctrl_trf_mem == USB_EP0_ROM){   // Determine type of memory source
        while(byteToSend){
            *pDst++ = *inPipes[0].pSrc.bRom++;
            byteToSend--;
        }//end while(byte_to_send.Val)
    } else {  // RAM
        while(byteToSend){
            *pDst++ = *inPipes[0].pSrc.bRam++;
            byteToSend--;
        }
    }
}//end USBCtrlTrfTxService

/******************************************************************************
 * Function:        void USBCtrlTrfRxService(void)
 *
 * PreCondition:    pDst and wCount are setup properly.
 *                  pSrc is always &CtrlTrfData
 *                  usb_stat.ctrl_trf_mem is always USB_EP0_RAM.
 *                  wCount should be set to 0 at the start of each control
 *                  transfer.
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine is used for host to device control transfers
 *                    (uses OUT transactions).  This function receives the data that arrives
 *                    on EP0 OUT, and copies it into the appropriate outPipes[0].pDst.bRam
 *                    buffer.  Once the host has sent all the data it was intending
 *                    to send, this function will call the appropriate outPipes[0].pFunc()
 *                    handler (unless it is NULL), so that it can be used by the
 *                    intended target firmware.
 *
 * Note:            None
 *****************************************************************************/
static void USBCtrlTrfRxService(void)
{
    uint8_t byteToRead;
    uint8_t i;

    //Load byteToRead with the number of bytes the host just sent us in the
    //last OUT transaction.
    byteToRead = pBDTEntryEP0OutCurrent->CNT;

    //Update the "outPipes[0].wCount.Val", which keeps track of the total number
    //of remaining bytes expected to be received from the host, in the control
    //transfer.  First check to see if the host sent us more bytes than the
    //application firmware was expecting to receive.
    if(byteToRead > outPipes[0].wCount.Val) byteToRead = outPipes[0].wCount.Val;
    //Reduce the number of remaining bytes by the number we just received.
    outPipes[0].wCount.Val -= byteToRead;

    //Copy the OUT DATAx packet bytes that we just received from the host,
    //into the user application buffer space.
    for(i=0;i<byteToRead;i++){
        *outPipes[0].pDst.bRam++ = CtrlTrfData[i];
    }

    //If there is more data to receive, prepare EP0 OUT so that it can receive
    //the next packet in the sequence.
    if(outPipes[0].wCount.Val > 0){
        pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&CtrlTrfData);
        if(pBDTEntryEP0OutCurrent->STAT.DTS == 0){
            pBDTEntryEP0OutNext->STAT.Val = _DAT1|(_DTSEN & _DTS_CHECKING_ENABLED);
            pBDTEntryEP0OutNext->STAT.Val |= _USIE;
        } else {
            pBDTEntryEP0OutNext->STAT.Val = _DAT0|(_DTSEN & _DTS_CHECKING_ENABLED);
            pBDTEntryEP0OutNext->STAT.Val |= _USIE;
        }
    } else {
        //We have received all OUT packets that we were expecting to
        //receive for the control transfer.  Prepare EP0 OUT to receive
        //the next SETUP transaction that may arrive.
        pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&SetupPkt);
        //Configure EP0 OUT to receive the next SETUP transaction for any future
        //control transfers.  However, set BSTALL in case the host tries to send
        //more data than it claims it was going to send.
        pBDTEntryEP0OutNext->STAT.Val = _BSTALL;
        pBDTEntryEP0OutNext->STAT.Val |= _USIE;

        //All data bytes for the host to device control write (OUT) have now been
        //received successfully.
        //Go ahead and call the user specified callback function, to use/consume
        //the control transfer data (ex: if the "void (*function)" parameter
        //was non-NULL when USBEP0Receive() was called).
        if(outPipes[0].pFunc != NULL) outPipes[0].pFunc(); //Call the user's callback function
        outPipes[0].info.bits.busy = 0;

        //Ready to arm status stage IN transaction now, if the application
        //firmware has completed processing the request.  If it is still busy
        //and needs more time to finish handling the request, then the user
        //callback (the one called by the outPipes[0].pFunc();) should set the
        //USBDeferStatusStagePacket to true (by calling USBDeferStatusStage()).  In
        //this case, it is the application's firmware responsibility to call
        //the USBCtrlEPAllowStatusStage() function, once it is fully done handling the request.
        //Note: The application firmware must process the request and call
        //USBCtrlEPAllowStatusStage() in a semi-timely fashion.  "Semi-timely"
        //means either 50ms, 500ms, or 5 seconds, depending on the type of
        //control transfer.  See the USB 2.0 specification section 9.2.6 for
        //more details.
        if(USBDeferStatusStagePacket == false) USBCtrlEPAllowStatusStage();
    }

}//end USBCtrlTrfRxService


