memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
/********************************************************************
 * Function:        void USBStdSetCfgHandler(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine first disables all endpoints by
 *                  clearing UEP registers. It then configures
 *                  (initializes) endpoints by calling the callback
 *                  function USBCBInitEP().
 *
 * Note:            None
 *******************************************************************/
static void USBStdSetCfgHandler(void)
{
    uint8_t i;

    // This will generate a zero length packet
    inPipes[0].info.bits.busy = 1;

    //Clear all of the endpoint control registers
    DisableNonZeroEndpoints(USB_MAX_EP_NUMBER);

    //Clear all of the BDT entries
    memset((void*)&BDT[0], 0x00, sizeof(BDT));

    // Assert reset request to all of the Ping Pong buffer pointers
    USBPingPongBufferReset = 1;

    //Re-Initialize all ping pong software state bits to 0 (which corresponds to
    //the EVEN buffer being the next one that will be used), since we are also
    //doing a hardware ping pong pointer reset above.
    for(i = 0; i < (uint8_t)(USB_MAX_EP_NUMBER+1u); i++){
        ep_data_in[i].Val = 0u;
        ep_data_out[i].Val = 0u;
    }

    //clear the alternate interface settings
    memset((void*)&USBAlternateInterface,0x00,USB_MAX_NUM_INT);

    //Stop trying to reset ping pong buffer pointers
    USBPingPongBufferReset = 0;

    pBDTEntryIn[0] = (volatile BDT_ENTRY*)&BDT[EP0_IN_EVEN];

    //Set the next out to the current out packet
    pBDTEntryEP0OutCurrent = (volatile BDT_ENTRY*)&BDT[EP0_OUT_EVEN];
    pBDTEntryEP0OutNext = pBDTEntryEP0OutCurrent;

    //set the current configuration
    USBActiveConfiguration = SetupPkt.bConfigurationValue;

    //if the configuration value == 0
    if(USBActiveConfiguration == 0){
        //Go back to the addressed state
        USBDeviceState = ADDRESS_STATE;
    } else {
        //initialize the required endpoints
        USB_SET_CONFIGURATION_HANDLER(EVENT_CONFIGURED,(void*)&USBActiveConfiguration,1);

        //Otherwise go to the configured state.  Update the state variable last,
        //after performing all of the set configuration related initialization
        //tasks.
        USBDeviceState = CONFIGURED_STATE;
    }//end if(SetupPkt.bConfigurationValue == 0)
}//end USBStdSetCfgHandler


/********************************************************************
 * Function:        void USBStdGetDscHandler(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine handles the standard GET_DESCRIPTOR
 *                  request.
 *
 * Note:            None
 *******************************************************************/
static void USBStdGetDscHandler(void)
{
    if(SetupPkt.bmRequestType != 0x80) return;

    inPipes[0].info.Val = USB_EP0_ROM | USB_EP0_BUSY | USB_EP0_INCLUDE_ZERO;

    switch(SetupPkt.bDescriptorType){
        case USB_DESCRIPTOR_DEVICE:
            #if !defined(USB_USER_DEVICE_DESCRIPTOR)
                inPipes[0].pSrc.bRom = (const uint8_t*)&device_dsc;
            #else
                inPipes[0].pSrc.bRom = (const uint8_t*)USB_USER_DEVICE_DESCRIPTOR;
            #endif
            inPipes[0].wCount.Val = sizeof(device_dsc);
            break;
        case USB_DESCRIPTOR_CONFIGURATION:
            //First perform error case check, to make sure the host is requesting a
            //legal descriptor index.  If the request index is illegal, don't do
            //anything (so that the default STALL response will be sent).
            if(SetupPkt.bDscIndex < USB_MAX_NUM_CONFIG_DSC){
                #if !defined(USB_USER_CONFIG_DESCRIPTOR)
                    inPipes[0].pSrc.bRom = *(USB_CD_Ptr+SetupPkt.bDscIndex);
                #else
                    inPipes[0].pSrc.bRom = *(USB_USER_CONFIG_DESCRIPTOR+SetupPkt.bDscIndex);
                #endif

                //This must be loaded using byte addressing.  The source pointer
                //  may not be word aligned for the 16 or 32 bit machines resulting
                //  in an address error on the dereference.
                inPipes[0].wCount.byte.LB = *(inPipes[0].pSrc.bRom+2);
                inPipes[0].wCount.byte.HB = *(inPipes[0].pSrc.bRom+3);
            } else {
                inPipes[0].info.Val = 0;
            }
            break;
        case USB_DESCRIPTOR_STRING:
            //USB_NUM_STRING_DESCRIPTORS was introduced as optional in release v2.3.  In v2.4 and
            //  later it is now mandatory.  This should be defined in usb_device_config.h and should
            //  indicate the number of string descriptors.
            if(SetupPkt.bDscIndex<USB_NUM_STRING_DESCRIPTORS){
                //Get a pointer to the String descriptor requested
                inPipes[0].pSrc.bRom = *(USB_SD_Ptr+SetupPkt.bDscIndex);
                // Set data count
                inPipes[0].wCount.Val = *inPipes[0].pSrc.bRom;
            }
            #if defined(IMPLEMENT_MICROSOFT_OS_DESCRIPTOR)
            else if(SetupPkt.bDscIndex == MICROSOFT_OS_DESCRIPTOR_INDEX){
                //Get a pointer to the special MS OS string descriptor requested
                inPipes[0].pSrc.bRom = (const uint8_t*)&MSOSDescriptor;
                // Set data count
                inPipes[0].wCount.Val = *inPipes[0].pSrc.bRom;
            }
            #endif
            else {
                inPipes[0].info.Val = 0;
            }
            break;
        default:
            inPipes[0].info.Val = 0;
            break;
    }//end switch
}//end USBStdGetDscHandler

/********************************************************************
 * Function:        void USBStdGetStatusHandler(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine handles the standard GET_STATUS request
 *
 * Note:            None
 *******************************************************************/
static void USBStdGetStatusHandler(void)
{
    CtrlTrfData[0] = 0;                 // Initialize content
    CtrlTrfData[1] = 0;

    switch(SetupPkt.Recipient){
        case USB_SETUP_RECIPIENT_DEVICE_BITFIELD:
            inPipes[0].info.bits.busy = 1;
            /*
             * [0]: bit0: Self-Powered Status [0] Bus-Powered [1] Self-Powered
             *      bit1: RemoteWakeup        [0] Disabled    [1] Enabled
             */
            if(self_power == 1) CtrlTrfData[0]|=0x01; // self_power is defined in HardwareProfile.h
            if(RemoteWakeup == true) CtrlTrfData[0]|=0x02;
            break;
        case USB_SETUP_RECIPIENT_INTERFACE_BITFIELD:
            inPipes[0].info.bits.busy = 1;     // No data to update
            break;
        case USB_SETUP_RECIPIENT_ENDPOINT_BITFIELD:
            inPipes[0].info.bits.busy = 1;
            /*
             * [0]: bit0: Halt Status [0] Not Halted [1] Halted
             */
            BDT_ENTRY *p;

            if(SetupPkt.EPDir == 0) p = (BDT_ENTRY*)pBDTEntryOut[SetupPkt.EPNum];
            else p = (BDT_ENTRY*)pBDTEntryIn[SetupPkt.EPNum];

            if((p->STAT.UOWN == 1) && (p->STAT.BSTALL == 1)) CtrlTrfData[0]=0x01;    // Set bit0
            break;
    }

    if(inPipes[0].info.bits.busy == 1){
        inPipes[0].pSrc.bRam = (uint8_t*)&CtrlTrfData;        // Set Source
        inPipes[0].info.bits.ctrl_trf_mem = USB_EP0_RAM;      // Set memory type
        inPipes[0].wCount.v[0] = 2;                           // Set data count
    }
}//end USBStdGetStatusHandler

