memen45/PIC32MX_CPP/mcc_generated_files/usb/usb_device.c
/********************************************************************
 * Function:        void USBStdFeatureReqHandler(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          Can alter BDT entries.  Can also modify USB stack
 *                  Maintained variables.
 *
 * Side Effects:    None
 *
 * Overview:        This routine handles the standard SET & CLEAR
 *                  FEATURES requests
 *
 * Note:            This is a private function, intended for internal
 *                  use by the USB stack, when processing SET/CLEAR
 *                  feature requests.
 *******************************************************************/
static void USBStdFeatureReqHandler(void)
{
    BDT_ENTRY *p;
    EP_STATUS current_ep_data;
    uint32_t* pUEP;


    //Check if the host sent a valid SET or CLEAR feature (remote wakeup) request.
    if((SetupPkt.bFeature == USB_FEATURE_DEVICE_REMOTE_WAKEUP)&&
       (SetupPkt.Recipient == USB_SETUP_RECIPIENT_DEVICE_BITFIELD)){
        inPipes[0].info.bits.busy = 1;
        if(SetupPkt.bRequest == USB_REQUEST_SET_FEATURE) RemoteWakeup = true;
        else RemoteWakeup = false;
    }

    //Check if the host sent a valid SET or CLEAR endpoint halt request.
    if((SetupPkt.bFeature == USB_FEATURE_ENDPOINT_HALT)&&
       (SetupPkt.Recipient == USB_SETUP_RECIPIENT_ENDPOINT_BITFIELD)&&
       (SetupPkt.EPNum != 0) && (SetupPkt.EPNum <= USB_MAX_EP_NUMBER)&&
       (USBDeviceState == CONFIGURED_STATE)){
        //The request was valid.  Take control of the control transfer and
        //perform the host requested action.
        inPipes[0].info.bits.busy = 1;

        //Fetch a pointer to the BDT that the host wants to SET/CLEAR halt on.
        if(SetupPkt.EPDir == OUT_FROM_HOST){
            p = (BDT_ENTRY*)pBDTEntryOut[SetupPkt.EPNum];
            current_ep_data.Val = ep_data_out[SetupPkt.EPNum].Val;
        } else {
            p = (BDT_ENTRY*)pBDTEntryIn[SetupPkt.EPNum];
            current_ep_data.Val = ep_data_in[SetupPkt.EPNum].Val;
        }

        //If ping pong buffering is enabled on the requested endpoint, need
        //to point to the one that is the active BDT entry which the SIE will
        //use for the next attempted transaction on that EP number.
        if(current_ep_data.bits.ping_pong_state == 0){ //Check if even
            p = (BDT_ENTRY*)(((uintptr_t)p) & (~USB_NEXT_PING_PONG));
        } else {//else must have been odd
            p = (BDT_ENTRY*)(((uintptr_t)p) | USB_NEXT_PING_PONG);
        }

        //Update the BDT pointers with the new, next entry based on the feature
        //  request
        if(SetupPkt.EPDir == OUT_FROM_HOST){
            pBDTEntryOut[SetupPkt.EPNum] = (volatile BDT_ENTRY *)p;
        } else {
            pBDTEntryIn[SetupPkt.EPNum] = (volatile BDT_ENTRY *)p;
        }

        //Check if it was a SET_FEATURE endpoint halt request
        if(SetupPkt.bRequest == USB_REQUEST_SET_FEATURE){
            if(p->STAT.UOWN == 1){
                //Mark that we are terminating this transfer and that the user
                //  needs to be notified later
                if(SetupPkt.EPDir == OUT_FROM_HOST){
                    ep_data_out[SetupPkt.EPNum].bits.transfer_terminated = 1;
                } else {
                    ep_data_in[SetupPkt.EPNum].bits.transfer_terminated = 1;
                }
            }

            //Then STALL the endpoint
            p->STAT.Val |= _BSTALL;
            p->STAT.Val |= _USIE;
        } else {
            //Else the request must have been a CLEAR_FEATURE endpoint halt.
            //toggle over the to the non-active BDT
            p = (BDT_ENTRY*)(((uintptr_t)p) ^ USB_NEXT_PING_PONG);

            if(p->STAT.UOWN == 1){
                //Clear UOWN and set DTS state so it will be correct the next time
                //the application firmware uses USBTransferOnePacket() on the EP.
                p->STAT.Val &= (~_USIE);    //Clear UOWN bit
                p->STAT.Val |= _DAT1;       //Set DTS to DATA1
                USB_TRANSFER_TERMINATED_HANDLER(EVENT_TRANSFER_TERMINATED,p,sizeof(p));
            } else {
                //UOWN already clear, but still need to set DTS to DATA1
                p->STAT.Val |= _DAT1;
            }

            //toggle back to the active BDT (the one the SIE is currently looking at
            //and will use for the next successful transaction to take place on the EP
            p = (BDT_ENTRY*)(((uintptr_t)p) ^ USB_NEXT_PING_PONG);

            //Check if we are currently terminating, or have previously terminated
            //a transaction on the given endpoint.  If so, need to clear UOWN,
            //set DTS to the proper state, and call the application callback
            //function.
            if((current_ep_data.bits.transfer_terminated != 0) || (p->STAT.UOWN == 1)){
                if(SetupPkt.EPDir == OUT_FROM_HOST){
                    ep_data_out[SetupPkt.EPNum].bits.transfer_terminated = 0;
                } else {
                    ep_data_in[SetupPkt.EPNum].bits.transfer_terminated = 0;
                }
                //clear UOWN, clear DTS to DATA0, and finally remove the STALL condition
                p->STAT.Val &= ~(_USIE | _DAT1 | _BSTALL);
                //Call the application event handler callback function, so it can
                //decide if the endpoint should get re-armed again or not.
                USB_TRANSFER_TERMINATED_HANDLER(EVENT_TRANSFER_TERMINATED,p,sizeof(p));
            } else {
                //clear UOWN, clear DTS to DATA0, and finally remove the STALL condition
                p->STAT.Val &= ~(_USIE | _DAT1 | _BSTALL);
            }

            //Get a pointer to the appropriate UEPn register
            pUEP = (uint32_t*)(&U1EP0);
            pUEP += (SetupPkt.EPNum*4);

            //Clear the STALL bit in the UEP register
            *pUEP &= ~UEP_STALL;
        }//end if(SetupPkt.bRequest == USB_REQUEST_SET_FEATURE)
    }//end if (lots of checks for set/clear endpoint halt)
}//end USBStdFeatureReqHandler




/**************************************************************************
    Function:
        void USBIncrement1msInternalTimers(void)

    Description:
        This function increments internal 1ms time base counters, which are
        useful for application code (that can use a 1ms time base/counter), and
        for certain USB event timing specific purposes.

        In USB full speed applications, the application code does not need to (and should
        not) explicitly call this function, as the USBDeviceTasks() function will
        automatically call this function whenever a 1ms time interval has elapsed
        (assuming the code is calling USBDeviceTasks() frequently enough in USB_POLLING
        mode, or that USB interrupts aren't being masked for more than 1ms at a time
        in USB_INTERRUPT mode).

